[
    {
        "title": "Proxy Inverso",
        "description": "Desarrollo de un proxy inverso para mejorar la seguridad de la empresa. Esta solución permite una configuración sencilla y la implementación de múltiples archivos de configuración. Además, incluye una página de mantenimiento que se activa durante actualizaciones del servidor. La implementación se realizó con Nginx y se desplegó en un servidor Linux utilizando Docker.",
        "year": "2025-Enero"
    },
    {
        "title": "Gestor de Cursos",
        "description": "Desarrollo de una aplicación web para la gestión de cursos en un centro de estudios. Permite la carga de documentos en una base de datos MariaDB y la exportación de datos en formato Excel. En este proyecto, me enfoqué principalmente en el backend y la seguridad. Se utilizó C# para la creación de la API y JWT para el control de acceso y permisos mediante tokens. La implementación de un proxy inverso con Nginx y el despliegue en un servidor Linux con Docker también fueron parte del proyecto.",
        "year": "2024-Noviembre"
    },
    {
        "title": "Gestor de Tickets",
        "description": "Aplicación web para la gestión de tickets, diseñada para optimizar el seguimiento de tareas y reducir el uso de correos electrónicos. En este proyecto, fui responsable del backend, utilizando C# y Entity Framework para crear una API robusta, con validaciones y control de errores. También se implementó un sistema de logs para notificar posibles fallos y una API adicional para enviar notificaciones por correo electrónico a los usuarios. El despliegue se realizó con Docker.",
        "year": "2024-Octubre"
    },
    {
        "title": "Gestor de Usuarios",
        "description": "Aplicación web destinada a la gestión de usuarios, permitiendo controlar períodos de actividad, relaciones familiares, diferentes métodos de autenticación, y la asignación o revocación de permisos y perfiles para empleados. Trabajé principalmente en el backend, diseñando una API robusta con validaciones y control de errores, así como en la implementación de un sistema de logs. Se utilizaron JWT para la autenticación y seguridad, y se emplearon C# y Entity Framework en el backend, mientras que Laravel y JavaScript fueron utilizados en el frontend. El proyecto se desplegó en Docker.",
        "year": "2024"
    },
    {
        "title": "Proyectos con Laravel",
        "description": "Proyecto introductorio al framework Laravel.",
        "year": "2023-Abril"
    }
]